cask_args appdir: '/Applications'

# brew tap "homebrew/cask-fonts"
# brew install --cask font-plemol-jp
# brew install font-plemol-jp-nf
# brew install font-plemol-jp-hs
# brew install font-hackgen
# brew install font-hackgen-nerd

# brew

brew 'asdf'
# brew 'anyenv'
# brew 'deno'
brew 'cocoapods'
# brew 'ctop'
brew 'chezmoi'
# brew 'curl'
# brew 'cmake'
# brew 'fish'
brew 'fzf'
# brew 'gcc'
brew 'ghq'
# brew 'gist'
# brew 'git'
# brew 'goenv'
# brew 'grep'
# brew 'htop'
# brew 'hub'
# brew 'jq'
# brew 'libtool'
# brew 'mackup'
# brew 'mas'
brew 'neovim'
brew 'neofetch'
# brew 'nodenv'
# brew 'openssl'
brew 'peco'
# brew 'python'
# brew 'qemu'
# brew 'rbenv'
# brew 'reattach-to-user-namespace' # tmux copy to clipboard
# brew 'redis'
# brew 'rmtrash'
# brew 'ruby-build'
# brew 'sshrc'
# brew 'telnet'
# brew 'tmux'
# brew 'tig'
# brew 'tree'
# brew 'unrar'
# brew 'yarn'
# brew 'z'


## ========== Base ==========
# brew "fd"
brew "gh"
# brew "sd"
# brew "k6"
# brew "xz"
# brew "act"
# brew "bat"
# brew "exa"
# brew "fzf"
# brew "ghq"
# brew "git"
# brew 'mas'
# brew "nkf"
# brew "dust"
# brew "grep"
# brew "grex"
# brew "tmux"
# brew "shfmt"
# brew "neovim"
# brew "ffmpeg"
# brew "httpie"
# brew "rename"
# brew "git-lfs"
# brew "gnu-sed"
# brew "ripgrep"
# brew "lefthook"
# brew "minikube"
# brew "git-delta"
# brew "shellcheck"
# brew "youtube-dl"
# brew "imagemagick"
# brew "git-secrets"

# cask

cask '1password'
# cask 'android-file-transfer'
cask 'android-studio'
# cask 'asana'
# cask 'alfred'
# cask 'appcleaner'
# cask 'bartender'
# cask 'bitbar'
# cask 'chromium'
cask 'cursor'
# cask 'cursorsense'
# cask 'vivaldi'
# cask 'caffeine'
# cask 'cyberduck'
# cask 'docker'
# cask 'dropbox'
# cask 'drawio'
# cask 'emacs'
# cask 'evernote'
# cask 'fantastical'
# cask 'google-cloud-sdk'
# cask 'github'
cask 'google-chrome'
# cask 'google-japanese-ime'
cask 'ghostty'
# cask 'grandperspective'
# cask 'gyazo'
cask 'iterm2'
# cask 'joplin'
cask 'karabiner-elements'
# cask 'keycastr'
# cask 'logseq'
cask 'linearmouse'
# cask 'ngrok'
# cask 'notion'
cask 'obsidian'
cask 'onedrive'
# cask 'paw'
# cask 'postico'
# cask 'raycast'
# cask 'scroll-reverser'
# cask 'sequel-pro'
cask 'slack'
# cask 'ticktick'
cask 'todoist-app'
cask 'visual-studio-code'
# cask 'vlc'
# cask 'vivaldi'
cask 'discord'
cask 'steam'
# cask 'dynalist'
# cask 'notion'
# cask 'wezterm'
# cask 'zed'


# cask "gimp"
# cask "zoom"
# cask "postman"
# cask "gpg-suite"
# cask "rectangle"
# cask "ubersicht"
# cask "sequel-ace"
# cask "displaylink"
# cask "android-studio"
# cask "db-browser-for-sqlite"

## ========== RISC-V ==========
# tap "riscv-software-src/riscv"
# brew "riscv-tools"

## ========== Fonts ==========
# tap  "homebrew/cask-fonts"
# cask "font-fontawesome"
# cask "font-hack-nerd-font"

## ========== Language ==========
# brew "gcc"
# brew "gdb"
# brew "asdf"
# brew "rustup"

## ========== Shell ==========
# brew "zsh"
# brew "zsh-completions"
# brew "zsh-autosuggestions"
# brew "zsh-git-prompt"

# mas

# mas 'Amphetamine', id: 937984704
# mas 'Bandwidth+', id: 490461369
# mas 'Craft - Docs and Notes Editor', id: 1487937127
# mas 'Evernote', id: 406056744
mas 'LINE', id: 539883307
# mas 'LanScan', id: 472226235
# mas 'Night Owl', id: 428834068
# mas 'Pocket', id: 568494494
# mas 'Skitch', id: 425955336
# mas 'Todoist', id: 585829637
# mas 'Microsoft To Do', id: 1274495053
mas 'Kindle', id: 302584613
# mas 'TickTick:To-Do List, Calendar', id: 966085870
# mas "TweetDeck", id: 485812721
# mas 'Magnet', id: 441258766
# mas 'Tweetbot 2 for Twitter', id: 557168941
# mas 'Toggl Desktop', id: 957734279
# mas 'Be Focused Pro - Focus Timer', id: 961632517
# mas '1Password 7 - Password Manager', id: 1333542190
# mas 'Spark - Email App by Readdle', id: 1176895641
# mas "Xcode", id: 497799835

# mas "Reeder 5.", id: 1529448980
# mas "iMovie", id: 408981434
# mas "GarageBand", id: 682658836
# mas "Keynote", id: 409183694
# mas "Pages", id: 409201541
# mas "Numbers", id: 409203825
